Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Chart data scope
fr: Portée des données du graphique
ko: 차트 데이터 범위
tr: Grafik veri kapsamı
vi: Phạm vi dữ liệu biểu đồ
zh_hans: 图表数据范围
zh_hant: 圖表資料範圍

source: All Selected Tags
fr: Toutes les balises sélectionnées

source: LSP process is not running
fr: Le processus LSP n'est pas en cours d'exécution.
ko: LSP 프로세스가 실행 중이 아닙니다
tr: LSP süreci çalışmıyor
vi: Tiến trình LSP không chạy
zh_hans: LSP 进程未运行
zh_hant: LSP 處理程序未在執行

source: Some columns in this preset don't exist in the current table
fr: Certaines colonnes de ce préréglage n'existent pas dans la table actuelle.
ko: 이 프리셋의 일부 열이 현재 테이블에 없습니다
tr: Bu ön ayardaki bazı sütunlar mevcut tabloda yok
vi: Một số cột trong bộ lọc không tồn tại trong bảng hiện tại
zh_hans: 此预设中的某些列在当前表中不存在
zh_hant: 此預設集中的某些欄位在目前資料表中不存在

source: Statement text
fr: Texte de déclaration
ko: 명령문 텍스트
tr: İfade metni
vi: Nội dung câu lệnh
zh_hans: 语句文本
zh_hant: 陳述式文字

source: What is switched on here is ignored when two structures are compared. These drift between environments by design.
fr: Ce qui est activé ici est ignoré lorsqu'on compare deux structures. Elles dérivent entre les environnements par conception.
ko: 여기서 켠 항목은 두 구조를 비교할 때 무시됩니다. 이 항목들은 환경마다 다른 것이 정상입니다.
tr: Burada açılanlar, iki yapı karşılaştırılırken yok sayılır. Bunlar ortamlar arasında tasarım gereği farklılaşır.
vi: Những gì được bật ở đây sẽ bị bỏ qua khi so sánh hai cấu trúc. Chúng vốn khác nhau giữa các môi trường.
zh_hans: 这里开启的项目在比较两个结构时会被忽略。它们在不同环境之间本来就会有差别。
zh_hant: 這裡開啟的項目在比較兩個結構時會被忽略。它們在不同環境之間本來就會有差別。

source: TablePro is a native macOS database client. This server exposes the connections the user has already configured, so you never handle credentials: name a connection by its id and TablePro opens, reuses and authorizes it for you. Start with list_connections, then list_databases, list_schemas and list_tables to find your way around, and describe_table before writing any query, because it returns the columns, indexes and foreign keys you need to get the SQL right the first time. Prefer the dedicated tools over hand-written SQL wherever one exists: they quote identifiers correctly for the engine in front of you, apply the user's row limits, and are allowed on connections where raw execution is not. Every connection carries the user's own policy. A connection may be read-only for external clients, may be invisible to AI entirely, and may be in a safe mode that asks the user to confirm each write. A refusal is that policy speaking, not a transient error, so do not retry it and do not look for a way around it. Destructive statements need the user's consent, which TablePro collects itself.
fr: TablePro est un client de base de données macOS natif. Ce serveur expose les connexions que l'utilisateur a déjà configurées, vous n'avez donc jamais à gérer les identifiants : nommez une connexion par son identifiant et TablePro l'ouvre, la réutilise et l'autorise pour vous. Commencez par list_connections, puis list_databases, list_schemas et list_tables pour vous orienter, et describe_table avant d'écrire toute requête, car elle renvoie les colonnes, les index et les clés étrangères dont vous avez besoin pour obtenir le SQL correctement la première fois. Préférez les outils dédiés au SQL écrit à la main où l'un existe : ils citent correctement les identifiants pour le moteur devant vous, appliquent les limites de rang de l'utilisateur et sont autorisés sur les connexions où l'exécution brute n'est pas autorisée. Chaque connexion porte sa propre politique de l'utilisateur. Une connexion peut être en lecture seule pour les clients externes, peut être totalement invisible pour l'IA et peut être en mode sécurisé qui demande à l'utilisateur de confirmer chaque écriture. Un refus est la politique qui parle, pas une erreur transitoire, alors ne réessayez pas et ne cherchez pas un moyen de contourner cela. Les déclarations destructrices nécessitent le consentement de l'utilisateur, que TablePro collecte lui-même.
ko: TablePro는 네이티브 macOS 데이터베이스 클라이언트입니다. 이 서버는 사용자가 이미 구성해 둔 연결을 노출하므로 자격 증명을 직접 다룰 일이 없습니다. 연결을 id로 지정하면 TablePro가 대신 열고, 재사용하고, 권한을 부여합니다. list_connections로 시작한 뒤 list_databases, list_schemas, list_tables로 구조를 파악하고, 쿼리를 작성하기 전에 describe_table을 호출하십시오. 첫 시도에 올바른 SQL을 쓰는 데 필요한 열, 인덱스, 외래 키를 돌려주기 때문입니다. 전용 도구가 있는 곳에서는 손으로 쓴 SQL보다 그 도구를 사용하십시오. 눈앞의 엔진에 맞게 식별자를 인용하고, 사용자의 행 제한을 적용하며, 원시 실행이 허용되지 않는 연결에서도 사용할 수 있습니다. 모든 연결에는 사용자 고유의 정책이 따라붙습니다. 어떤 연결은 외부 클라이언트에 읽기 전용일 수 있고, AI에게 아예 보이지 않을 수도 있으며, 쓰기마다 사용자 확인을 요구하는 안전 모드일 수도 있습니다. 거부는 일시적인 오류가 아니라 그 정책이 말하는 것이므로, 다시 시도하지 말고 우회하려 하지 마십시오. 파괴적인 명령문에는 사용자의 동의가 필요하며, 이는 TablePro가 직접 받습니다.
tr: TablePro, yerel bir macOS veritabanı istemcisidir. Bu sunucu, kullanıcının zaten yapılandırdığı bağlantıları sunar, bu yüzden hiçbir zaman kimlik bilgisi ile uğraşmazsınız: bir bağlantıyı kimliğiyle adlandırın, TablePro sizin için onu açar, yeniden kullanır ve yetkilendirir. list_connections ile başlayın, sonra yolunuzu bulmak için list_databases, list_schemas ve list_tables kullanın; herhangi bir sorgu yazmadan önce describe_table çağırın, çünkü SQL'i ilk seferde doğru yazmak için gereken sütunları, indeksleri ve yabancı anahtarları döndürür. Özel bir araç varsa elle yazılmış SQL yerine onu tercih edin: önünüzdeki motora göre tanımlayıcıları doğru tırnaklar, kullanıcının satır sınırlarını uygular ve ham çalıştırmanın izinli olmadığı bağlantılarda da kullanılabilir. Her bağlantı kullanıcının kendi politikasını taşır. Bir bağlantı dış istemciler için salt okunur olabilir, yapay zekâya tamamen görünmez olabilir ve her yazmayı kullanıcıya onaylatan bir güvenli modda olabilir. Bir ret, geçici bir hata değil, o politikanın konuşmasıdır; bu yüzden yeniden denemeyin ve etrafından dolaşmanın yolunu aramayın. Yıkıcı ifadeler kullanıcının onayını gerektirir ve bunu TablePro kendisi toplar.
vi: TablePro là một ứng dụng khách cơ sở dữ liệu gốc trên macOS. Máy chủ này để lộ ra những kết nối mà người dùng đã cấu hình sẵn, nên bạn không bao giờ phải xử lý thông tin đăng nhập: chỉ cần gọi tên một kết nối bằng id của nó và TablePro sẽ mở, tái sử dụng và cấp quyền thay bạn. Hãy bắt đầu với list_connections, rồi dùng list_databases, list_schemas và list_tables để định hướng, và gọi describe_table trước khi viết bất kỳ truy vấn nào, vì nó trả về các cột, chỉ mục và khoá ngoại bạn cần để viết SQL đúng ngay từ lần đầu. Ở đâu có công cụ chuyên dụng thì hãy ưu tiên nó thay vì SQL viết tay: chúng trích dẫn định danh đúng theo engine trước mặt bạn, áp dụng giới hạn dòng của người dùng, và được phép dùng trên cả những kết nối không cho chạy lệnh thô. Mỗi kết nối mang theo chính sách riêng của người dùng. Một kết nối có thể chỉ đọc với client bên ngoài, có thể hoàn toàn ẩn với AI, và có thể đang ở chế độ an toàn yêu cầu người dùng xác nhận từng thao tác ghi. Một lời từ chối là chính sách đó lên tiếng, không phải lỗi tạm thời, nên đừng thử lại và đừng tìm cách đi vòng. Các câu lệnh có tính phá huỷ cần sự đồng ý của người dùng, và TablePro tự thu thập sự đồng ý đó.
zh_hans: TablePro 是一款原生 macOS 数据库客户端。此服务器公开用户已经配置好的连接，因此你从不接触凭据：用 id 指名一个连接，TablePro 就会替你打开、复用并授权它。 先从 list_connections 开始，再用 list_databases、list_schemas 和 list_tables 摸清结构，并在写任何查询之前调用 describe_table，因为它会返回你一次写对 SQL 所需的列、索引和外键。凡是有专用工具的地方，都优先用它而不是手写 SQL：它们会按你面前的引擎正确地为标识符加引号、应用用户的行数限制，并且在不允许原始执行的连接上也可以使用。 每个连接都带着用户自己的策略。一个连接可能对外部客户端只读，可能对 AI 完全不可见，也可能处于要求用户逐条确认写入的安全模式。被拒绝是这条策略在说话，而不是临时故障，所以不要重试，也不要找绕过的办法。破坏性语句需要用户同意，而这份同意由 TablePro 自己收集。
zh_hant: TablePro 是一款原生 macOS 資料庫用戶端。此伺服器公開使用者已經設定好的連線，因此你從不接觸憑證：用 id 指名一個連線，TablePro 就會替你開啟、重複使用並授權它。 先從 list_connections 開始，再用 list_databases、list_schemas 和 list_tables 摸清結構，並在寫任何查詢之前呼叫 describe_table，因為它會回傳你一次寫對 SQL 所需的欄位、索引和外鍵。凡是有專用工具的地方，都優先用它而不是手寫 SQL：它們會按你面前的引擎正確地為識別符號加引號、套用使用者的列數限制，並且在不允許原始執行的連線上也可以使用。 每個連線都帶著使用者自己的政策。一個連線可能對外部用戶端唯讀，可能對 AI 完全不可見，也可能處於要求使用者逐條確認寫入的安全模式。被拒絕是這條政策在說話，而不是暫時故障，所以不要重試，也不要找繞過的辦法。破壞性陳述式需要使用者同意，而這份同意由 TablePro 自己收集。

source: Max %lld characters
fr: Max %lld caractères
ko: 최대 %lld자
tr: Max %lld karakter
vi: Tối đa %lld ký tự
zh_hans: 最多 %lld 个字符
zh_hant: 最多 %lld 個字

source: Back Up…
fr: Sauvegarde...

source: Dropping %1$@ %2$@ removes it from the target.
fr: Le dépôt de %1$@ %2$@ le supprime de la cible.
ko: %1$@ %2$@을(를) 삭제하면 대상에서 제거됩니다.
tr: %1$@ %2$@ silmek onu hedeften kaldırır.
vi: Xóa %1$@ %2$@ sẽ loại bỏ nó khỏi đích.
zh_hans: 删除 %1$@ %2$@ 会将其从目标中移除。
zh_hant: 刪除 %1$@ %2$@ 會將其從目標中移除。

source: Anonymous (loopback)
fr: Anonyme (loopback)
ko: 익명(루프백)
tr: Anonim (loopback)
vi: Ẩn danh (loopback)
zh_hans: 匿名（回环）
zh_hant: 匿名（回送）

source: Cloudflare Access needs a browser sign-in. Sign in at %@, then reconnect.
fr: Cloudflare Access nécessite une connexion au navigateur. Connectez-vous à %@, puis reconnectez-vous.
ko: Cloudflare Access에 브라우저 로그인이 필요합니다. %@에서 로그인한 후 다시 연결하십시오.
tr: Cloudflare Access tarayıcıyla oturum açmayı gerektiriyor. %@ adresinde oturum açın, sonra yeniden bağlanın.
vi: Cloudflare Access cần đăng nhập qua trình duyệt. Đăng nhập tại %@, rồi kết nối lại.
zh_hans: Cloudflare Access需要浏览器登录。请在%@登录，然后重新连接。
zh_hant: Cloudflare Access 需要瀏覽器登入。請在 %@ 登入，然後重新連線。

source: Include Every Listed Row
fr: Inclure chaque ligne répertoriée

source: Last Activity
fr: Dernière activité
ko: 마지막 활동
tr: Son Etkinlik
vi: Hoạt động gần nhất
zh_hans: 最近活动
zh_hant: 最近活動

source: Could not complete Oracle native network encryption with this server. It may require an encryption or checksum algorithm the driver does not support.
fr: Impossible de terminer l'encodage réseau natif Oracle avec ce serveur. Il peut être nécessaire d'un algorithme d'encodage ou de chiffrage que le pilote ne prend pas en charge.
ko: 이 서버와 Oracle 네이티브 네트워크 암호화를 완료할 수 없습니다. 서버에서 드라이버가 지원하지 않는 암호화 또는 체크섬 알고리즘을 요구할 수 있습니다.
tr: Bu sunucuyla Oracle yerel ağ şifrelemesi tamamlanamadı. Sürücünün desteklemediği bir şifreleme veya sağlama algoritması gerekiyor olabilir.
vi: Không thể hoàn tất mã hóa mạng gốc của Oracle với máy chủ này. Có thể nó yêu cầu thuật toán mã hóa hoặc checksum mà driver không hỗ trợ.
zh_hans: 无法与此服务器完成 Oracle 原生网络加密。它可能需要驱动不支持的加密或校验和算法。
zh_hant: 無法與此伺服器完成 Oracle 原生網路加密。它可能需要驅動程式不支援的加密或總和檢查碼演算法。

source: Reassign to
fr: Réattribuer à
ko: 재할당 대상
tr: Şuna devret
vi: Chuyển cho
zh_hans: 转移给
zh_hant: 轉移給

source: Starting…
fr: Débutant...
ko: 시작 중…
tr: Başlatılıyor…
vi: Đang khởi động…
zh_hans: 正在启动…
zh_hant: 正在啟動…

source: Run the script against the target
fr: Exécutez le script contre la cible.
ko: 대상에 대해 스크립트 실행
tr: Betiği hedef üzerinde çalıştır
vi: Chạy script trên đích
zh_hans: 对目标运行此脚本
zh_hant: 對目標執行此指令稿

source: License Suspended
fr: Licence suspendue
ko: 라이선스가 정지되었습니다
tr: Lisans askıya alındı
vi: Giấy phép đã bị tạm ngưng
zh_hans: 许可证已被暂停
zh_hant: 授權已被暫停

source: Schema Switching Not Supported
fr: Le basculement de schémas n'est pas
ko: 스키마 전환이 지원되지 않음
tr: Şema Değiştirme Desteklenmiyor
vi: Không hỗ trợ chuyển schema
zh_hans: 不支持切换 Schema
zh_hant: 不支援切換綱要

source: Profile Details
fr: Détails du profil
ko: 프로필 세부사항
tr: Profil Ayrıntıları
vi: Chi tiết hồ sơ
zh_hans: 配置详情
zh_hant: 設定檔詳細資料

source: SSH connection timed out
fr: Délai d'attente de la connexion SSH expir
ko: SSH 연결 시간이 초과되었습니다
tr: SSH bağlantısı zaman aşımına uğradı
vi: Kết nối SSH đã hết thời gian
zh_hans: SSH 连接超时
zh_hant: SSH 連線逾時

source: The SSH server does not offer that authentication method.
fr: Le serveur SSH ne propose pas ce mode d'authentification.

source: Earliest
fr: Le plus ancien

source: Could not delete the profile. Check disk space and permissions, then try again.
fr: Impossible de supprimer le profil. Vérifiez l'espace disque et les permissions, puis réessayez.

source: Text
fr: Texte
ko: 텍스트
tr: Metin
vi: Văn bản
zh_hans: 文本
zh_hant: 文字

source: Match case exactly
fr: Correspondance exacte de la casse
ko: 대소문자를 정확히 일치
tr: Büyük/küçük harfi tam eşleştir
vi: Khớp chính xác chữ hoa chữ thường
zh_hans: 精确匹配大小写
zh_hant: 精確比對大小寫

source: Progress estimated (%lld tables could not be counted)
fr: Progrès estimé (%lld tables ne pouvaient pas être comptées)

source: Copy %lld Names
fr: Copier les noms %lld
ko: 이름 %lld개 복사
tr: %lld Adı Kopyala
vi: Sao chép %lld tên
zh_hans: 复制 %lld 个名称
zh_hant: 複製 %lld 個名稱

source: Connect Anyway
fr: Connectez-vous de toute façon
ko: 그래도 연결
tr: Yine de Bağlan
vi: Vẫn kết nối
zh_hans: 仍然连接
zh_hant: 仍要連線

source: Comma-separated tables whose columns the prompt includes, up to %1$d. The first %1$d by name when omitted
fr: Des tableaux séparés par des virgules dont les colonnes sont incluses dans le message de commande, jusqu'à %1$d. Le premier %1$d par nom lorsqu'il est omis.

source: List Foreign Keys
fr: Liste des clés étrangères
ko: 외래 키 목록
tr: Yabancı Anahtarları Listele
vi: Liệt kê khoá ngoại
zh_hans: 列出外键
zh_hant: 列出外鍵

source: Recently opened tables, newest first
fr: Tables récemment ouvertes, les plus récentes en premier
ko: 최근에 연 테이블이며 최신순입니다
tr: Son açılan tablolar, en yeniden başlayarak
vi: Các bảng mở gần đây, mới nhất trước
zh_hans: 最近打开的表，最新的在前
zh_hant: 最近開啟的資料表，最新的在前

source: Read-only
fr: En lecture seule
ko: 읽기 전용
tr: Salt okunur
vi: Chỉ đọc
zh_hans: 只读
zh_hant: 唯讀

source: Cancel Backup Dump?
fr: Annuler le décompte de sauvegarde ?
ko: 백업 덤프를 취소하시겠습니까?
tr: Yedek dökümü iptal edilsin mi?
vi: Hủy dump sao lưu?
zh_hans: 要取消备份转储吗？
zh_hant: 要取消資料庫備份嗎？

source: The value could not be parsed. Use raw mode to inspect it as text.
fr: La valeur n'a pas pu être analysée. Utilisez le mode brut pour l'inspecter sous forme de texte.
ko: 값을 구문 분석할 수 없습니다. 원시 모드에서 텍스트로 확인하십시오.
tr: Değer ayrıştırılamadı. Metin olarak incelemek için ham modu kullanın.
vi: Không phân tích được giá trị. Dùng chế độ raw để xem dưới dạng văn bản.
zh_hans: 无法解析该值。请使用原始模式以文本形式查看。
zh_hant: 無法解析該值。請使用原始模式以文字形式檢視。

source: Team
fr: Équipe
ko: 팀

source: Collapse junction tables into many-to-many relationships
fr: Réduisez les tables de jonction en relations un à plusieurs.
ko: 조인 테이블을 다대다 관계로 축소
tr: Bağlantı tablolarını çoktan çoğa ilişkilere daralt
vi: Thu gọn bảng trung gian thành quan hệ nhiều-nhiều
zh_hans: 将关联表折叠为多对多关系
zh_hant: 將關聯資料表摺疊為多對多關聯

source: File that was written, when output_path was given
fr: Fichier qui a été écrit lorsque le chemin de sortie a été donné.
ko: output_path를 지정한 경우 기록된 파일
tr: output_path verildiğinde yazılan dosya
vi: Tệp đã được ghi, khi có output_path
zh_hans: 提供 output_path 时写入的文件
zh_hant: 提供 output_path 時寫入的檔案

source: Attached %1$d of %2$d files. %3$@
fr: Ci-joint %1$d de fichiers %2$d. %3$@

source: Embedded zero-config SQL database
fr: Base de données SQL configurée à zéro intégrée
ko: 별도 설정이 필요 없는 임베디드 SQL 데이터베이스
tr: Gömülü, yapılandırma gerektirmeyen SQL veritabanı
vi: Cơ sở dữ liệu SQL nhúng, không cần cấu hình
zh_hans: 嵌入式零配置 SQL 数据库
zh_hant: 內嵌式零設定 SQL 資料庫

# Current %@: %@ (⌘K to %@)
source: Current %1$@: %2$@ (⌘K to %3$@)
fr: %1$@ actuel : %2$@ (⌘K à %3$@)
ko: 현재 %1$@: %2$@ (⌘K로 %3$@)
tr: Geçerli %1$@: %2$@ (%3$@ için ⌘K)
vi: %1$@ hiện tại: %2$@ (⌘K để %3$@)
zh_hans: 当前%1$@：%2$@（⌘K 可%3$@）
zh_hant: 目前的 %1$@：%2$@（⌘K 可%3$@）

source: Rows sent
fr: Lignes envoyées
ko: 전송된 행
tr: Gönderilen satırlar
vi: Số dòng đã gửi
zh_hans: 已发送的行
zh_hant: 已傳送的列

source: The listener does not know the requested service name
fr: L'auditeur ne connaît pas le nom du service demandé.
ko: 리스너가 요청한 서비스 이름을 인식하지 못합니다
tr: Dinleyici istenen hizmet adını tanımıyor
vi: Listener không biết tên dịch vụ được yêu cầu
zh_hans: 侦听器不认识请求的服务名
zh_hant: 接聽程式不認識請求的服務名稱

source: Panels to read. Omit for all.
fr: Panels à lire. Omettre pour tous.
ko: 읽을 패널입니다. 모두 읽으려면 생략하십시오.
tr: Okunacak paneller. Tümü için boş bırakın.
vi: Các bảng cần đọc. Bỏ trống để lấy tất cả.
zh_hans: 要读取的面板。省略则表示全部。
zh_hant: 要讀取的面板。省略則表示全部。

source: Shows database object comments next to tables in the sidebar and in grid column headers.
fr: Affiche les commentaires des objets de base de données à côté des tableaux dans la barre latérale et dans les en-têtes des colonnes de la grille.
ko: 사이드바의 테이블 옆과 그리드 열 머리글에 데이터베이스 객체 주석을 표시합니다.
tr: Veritabanı nesne yorumlarını kenar çubuğundaki tabloların yanında ve tablo sütun başlıklarında gösterir.
vi: Hiển thị ghi chú của đối tượng cơ sở dữ liệu cạnh các bảng trong thanh bên và trên tiêu đề cột của lưới.
zh_hans: 在侧边栏的表旁边和数据网格列标题中显示数据库对象注释。
zh_hant: 在側邊欄的資料表旁與資料格欄位標題中顯示資料庫物件註解。

source: Install it with “brew install sqlite” and link it.
fr: Installez-le avec "brew install sqlite" et l'associez.

source: Accepted values, or null for a true/false flag
fr: Valeurs acceptées, ou nuls pour un drapeau vrai/faux.

source: Try adjusting your search terms or date filter.
fr: Essayez d'ajuster vos termes de recherche. Ou filtre de date.
ko: 검색어 또는 날짜 필터를 조정해 보십시오.
vi: Thử điều chỉnh từ khoá tìm kiếm hoặc bộ lọc ngày.
zh_hans: 尝试调整搜索词 或日期筛选。
zh_hant: 請嘗試調整搜尋字詞 或日期篩選。

source: Cache Hit Ratio
fr: Ratio de succès de la cache
ko: 캐시 적중률
tr: Önbellek İsabet Oranı
vi: Tỷ lệ trúng cache
zh_hans: 缓存命中率
zh_hant: 快取命中率

source: Info
fr: Renseignements
ko: 정보
tr: Bilgi
vi: Thông tin
zh_hans: 信息
zh_hant: 資訊

source: Command Line
fr: Ligne de commande
ko: 명령줄
tr: Komut Satırı
vi: Dòng lệnh
zh_hans: 命令行
zh_hant: 命令列

source: Raw SQL
fr: SQL brut
ko: 원시 SQL
vi: SQL thô
zh_hans: 原始 SQL
zh_hant: 原始 SQL

source: This version is too large to compare. Showing its content instead.
fr: Cette version est trop grande pour être comparée. Son contenu est affiché à la place.

source: Multiple statements are not permitted for this client
fr: Plusieurs déclarations ne sont pas autorisées pour ce client.
ko: 이 클라이언트에서는 여러 쿼리문을 사용할 수 없습니다
tr: Bu istemci için birden çok deyime izin verilmiyor
vi: Client này không được phép chạy nhiều câu lệnh
zh_hans: 此客户端不允许执行多条语句
zh_hant: 此用戶端不允許執行多條語句

source: Rows the statement changed
fr: Lignes où la déclaration a changé
ko: 명령문이 변경한 행
tr: İfadenin değiştirdiği satırlar
vi: Số dòng mà câu lệnh đã thay đổi
zh_hans: 该语句更改的行
zh_hant: 該陳述式變更的列

source: Share connections and saved queries with your team through your account. Passwords are never included.
fr: Partagez les connexions et les requêtes enregistrées avec votre équipe via votre compte. Les mots de passe ne sont jamais inclus.
ko: 계정을 통해 연결 및 저장된 쿼리를 팀과 공유하십시오. 암호는 절대 포함되지 않습니다.
tr: Bağlantıları ve kayıtlı sorguları hesabınız üzerinden takımınızla paylaşın. Parolalar hiçbir zaman dahil edilmez.
vi: Chia sẻ kết nối và truy vấn đã lưu với nhóm của bạn thông qua tài khoản. Mật khẩu không bao giờ được đưa vào.
zh_hans: 通过你的账户与团队共享连接和已保存的查询。密码不会被包含在内。
zh_hant: 透過你的帳號與團隊共享連線和已儲存的查詢。密碼絕不會包含在內。

source: Disconnect from “%@”?
fr: Se déconnecter de « %@ » ?
ko: “%@” 연결을 해제하시겠습니까?
tr: “%@” bağlantısı kesilsin mi?
vi: Ngắt kết nối khỏi “%@”?
zh_hans: 要断开与“%@”的连接吗？
zh_hant: 要中斷與「%@」的連線嗎？

source: Argument list the engine reports, such as (date), when it reports one
fr: La liste des arguments énumère les rapports du moteur, tels que (date), lorsqu'il en rapporte un.
ko: 엔진이 보고하는 인수 목록입니다. 보고할 경우 (date)와 같은 형식입니다
tr: Motorun bildirdiği argüman listesi, bildirdiğinde (date) gibi
vi: Danh sách tham số mà engine báo cáo, ví dụ (date), khi nó có báo cáo
zh_hans: 引擎报告的参数列表，例如 (date)，前提是它有报告
zh_hant: 引擎回報的參數清單，例如 (date)，前提是它有回報

source: This shortcut is reserved for "%@" and cannot be assigned.
fr: Ce raccourci est réservé à "%@" et ne peut pas être attribué.
ko: 이 단축키는 "%@"에 예약되어 있어 지정할 수 없습니다.
tr: Bu kısayol "%@" için ayrılmıştır ve atanamaz.
vi: Phím tắt này được dành riêng cho "%@" và không thể gán.
zh_hans: 此快捷键已保留给 "%@"，无法分配。
zh_hant: 此快速鍵已保留給「%@」，無法指派。

source: Modified
fr: Modifié
ko: 수정됨
tr: Değiştirildi
vi: Đã sửa đổi
zh_hans: 已修改
zh_hant: 已修改

source: My Queries
fr: Mes questions
ko: 내 쿼리
tr: Sorgularım
vi: Truy vấn của tôi
zh_hans: 我的查询
zh_hant: 我的查詢

source: %@, partly staged
fr: %@, partiellement scénarisé

source: Whether the column is generated
fr: Que la colonne soit générée ou non
ko: 열이 생성된 열인지 여부
tr: Sütunun üretilmiş olup olmadığı
vi: Cột có phải cột sinh ra hay không
zh_hans: 该列是否为生成列
zh_hant: 該欄位是否為產生欄位

source: Imports
fr: Importations
ko: 데이터 가져오기
tr: İçe Aktarmalar
vi: Nhập dữ liệu
zh_hans: 导入
zh_hant: 匯入

source: No History
fr: Pas d'historique

source: %@ row
fr: %@ ligne
ko: %@행
tr: %@ satır
vi: %@ dòng
zh_hans: %@ 行
zh_hant: %@ 列

source: Client Key
fr: Clé du client
ko: 클라이언트 키
tr: İstemci Anahtarı
vi: Khóa máy khách
zh_hans: 客户端密钥
zh_hant: 用戶端金鑰

source: No matching databases
fr: Aucune base de données correspondante
ko: 일치하는 데이터베이스 없음
vi: Không có cơ sở dữ liệu nào khớp
zh_hans: 无匹配数据库
zh_hant: 無符合的資料庫

source: %1$@ … %2$d lines
fr: %1$@ ... %2$d lignes
ko: %1$@ … %2$d줄
tr: %1$@ … %2$d satır
vi: %1$@ … %2$d dòng
zh_hans: %1$@ … %2$d 行
zh_hant: %1$@ … %2$d 行

source: No Differences
fr: Aucune différence
ko: 차이 없음
tr: Fark Yok
vi: Không có khác biệt
zh_hans: 没有差异
zh_hant: 沒有差異

source: Feature Routing
fr: Routing des fonctionnalités
ko: 기능 라우팅
tr: Özellik Yönlendirme
vi: Định tuyến tính năng
zh_hans: 功能路由
zh_hant: 功能路由

source: %d statements would destroy data. Allow them or exclude them before applying.
fr: %d déclarations détruiraient les données. Autorisez-les ou excluez-les avant de les appliquer.

source: AI access policies are configured per-connection in each connection's settings.
fr: Les politiques d'accès à l'IA sont configurées par connexion dans les paramètres de chaque connexion.
ko: AI 접근 정책은 각 연결의 설정에서 연결별로 구성합니다.
tr: AI erişim politikaları her bağlantının ayarlarında ayrı ayrı yapılandırılır.
vi: Chính sách truy cập AI được cấu hình riêng cho từng kết nối trong phần cài đặt.
zh_hans: AI 访问策略在每个连接的设置中单独配置。
zh_hant: AI 存取原則在每個連線的設定中個別設定。

source: Truncate query results
fr: Truncation des résultats de la requête
ko: 쿼리 결과 자르기
tr: Sorgu sonuçlarını kırp
vi: Cắt bớt kết quả truy vấn
zh_hans: 截断查询结果
zh_hant: 截斷查詢結果

source: Selected Rows (%@)
fr: Lignes sélectionnées (%@)

source: pending truncate
fr: Truncation en attente
ko: TRUNCATE 대기 중
tr: boşaltılmayı bekliyor
vi: chờ truncate
zh_hans: 待清空
zh_hant: 待清空

source: Filter…
fr: Filtre...
ko: 필터링…
tr: Filtre…
vi: Lọc…
zh_hans: 筛选…
zh_hant: 篩選…

source: Format Query (⇧⌘L)
fr: Requête de formatage (⇧⌘L)
ko: 쿼리 서식 지정 (⇧⌘L)
tr: Sorguyu Biçimlendir (⇧⌘L)
vi: Định dạng truy vấn (⇧⌘L)
zh_hans: 格式化查询 (⇧⌘L)
zh_hant: 格式化查詢 (⇧⌘L)

source: Appearance
fr: Apparence
ko: 모양
tr: Görünüm
vi: Giao diện
zh_hans: 外观
zh_hant: 外觀

source: Everything else keeps working without a license, with nothing counting down.
fr: Tout le reste continue de fonctionner sans licence, sans que rien ne compte à rebours.
ko: 나머지 기능은 라이선스 없이도 계속 작동하며, 남은 기간을 세지 않습니다.
tr: Geri kalan her şey lisans olmadan da çalışmayı sürdürür ve hiçbir süre geri saymaz.
vi: Mọi thứ khác vẫn hoạt động khi không có giấy phép, và không có thời gian đếm ngược.
zh_hans: 其余功能没有许可证也照常使用，也不会倒计时。
zh_hant: 其餘功能沒有授權也照常使用，也不會倒數計時。

source: Backup Dump Complete
fr: Sauvegarde Dump Complète
ko: 백업 덤프 완료
tr: Yedek dökümü tamamlandı
vi: Hoàn tất dump sao lưu
zh_hans: 备份转储完成
zh_hant: 資料庫備份完成

source: Search All Columns
fr: Rechercher toutes les colonnes

source: Granted by another role
fr: Concessé par un autre rôle

source: Current schema
fr: Schéma actuel
ko: 현재 스키마
tr: Geçerli şema
vi: Schema hiện tại
zh_hans: 当前 Schema
zh_hant: 目前的綱要

source: Database: %@
fr: Base de données : %@
ko: 데이터베이스: %@
tr: Veritabanı: %@
vi: Cơ sở dữ liệu: %@
zh_hans: 数据库: %@
zh_hant: 資料庫：%@

source: Loading tables...
fr: Chargement des tables...
ko: 테이블 불러오는 중...
tr: Tablolar yükleniyor...
vi: Đang tải danh sách bảng...
zh_hans: 正在加载表...
zh_hant: 正在載入資料表…

source: Connection URL must include a host
fr: L'URL de connexion doit inclure un hôte.
ko: 연결 URL에 호스트가 포함되어야 합니다
tr: Bağlantı URL'si bir sunucu içermeli
vi: URL kết nối phải bao gồm host
zh_hans: 连接 URL 必须包含主机
zh_hant: 連線 URL 必須包含主機

source: Open in Query Editor puts %@ where each password goes. Replace it before running the script.
fr: Ouvrir dans l'éditeur de requêtes place %@ là où chaque mot de passe va. Remplacez-le avant d'exécuter le script.
